
# LEQCIA 1

# მეთოდი არის asrulebs ragac funqcionals


# int = any number
# float = dot numbers
# str = text/characters
# bool = true/false
# complex 
#arguments: \n = გადაყავს სხვა ხაზზე end = '' ერთ ხაზზე სვამს sep ='' შიგნით მოცემულ სიმბოლოს სვამს ასოების შორის 
# type func = გიბრუნებს შიგნით მოცემულ ტიპის მონაცემებს 
#f "" გაფორმატებული სტრინგი

# LEQCIA 2 მათემათიკუ ოპერატორები

# + , - , * , **(ახარისხება) , / , //(floor division), %(ნაშთის ოპერატორი)
# input() გარედან შემოგვაქვს მონაცემები ყოველთვის ინახება str-ში
# '' ერთი სიმბოლო "" სიტყვა

# LEQCIA 3 

#print ყოველთვის ხედავს ზემოდან უახლოეს 
# upper ადიდებს  lower ამცირებს ასოებს 
# capitalize წინადადებაში ადიდებს პირველი სიტყვის პირველ ასოს
# Title ადიდებს წინადადებასი ყველა სიტყვის პირველ ასოს 
# strip აშორებს სფეისებს მარცხნიდან და მარჯვნიდან lstrip მარტო მარცხნიდან rstrip მარტო მარჯვნიდან
# len გვიჩვენებს რამდენი სიმბოლო გვაქვს გამოყენებული სფეისი ითვლება


# LEQCIA 4  ლოგიკური ოპერატორები


# შედარების ოპერატორები <, >, <= , >=, !=, ==(მათემატიკური ტოლობა)
# ლოგიკური ოპერატორები and, or, not 


# LEQCIA 5  Error Handling

# ValueError  გიბრუნებს ერორს თუ არასწეორად დაწერე ფორმატი მაგალითად თუ ინტში ჩაწერე სტრინგი
# TypeError  გიბრუნებს როცა არასწორად გაქ დაწერილი პირობა მაგალითად სტრინგი გაამრავლე ინტზე "x" * 5
# ZeroDivisionError  გიბრუნემბს როცა ცდილობ გაყო 0-ზე
# try except ბლოკში შეგიძლია დდამუშაო შეცდომა
# finnaly ყოველთვის იბეჭდება ნებისმეირ შემთხვევაში


# LEQCIA 6 Loops – while & for

# while loop-ის დროს პირობა გრძელდება სანამ ჭეშმარიტია
# break აჩერებს პირობას continue კი ტოვებს პირობას
# for range  ამუშავებს პირობას ამ რეიჯში საიდან დაიწყოს სად მორჩება და რას გამოტოვებს start stop step


# LEQCIA 7


#collection:  list [], tuple(), dictionary{}, set()  viyenebt monacemta shenaxvistvis


# list ინახავს მონაცემებს რომ არ ვწეროთ ყველა ელემენტისთვის თითო თითო ცვლადს 

# append  ამატებს ერთ ელემენტს
# extend ამატებს რამოდენიმე ელემენტს უნდა იყოს ლისტში
# insert(index, value) ამატებს ელემენტს იმ ინდექსზე სადაც მივუთითებთ
# remove(value)  შლის მითითებულ ელემენტს თუ ის არის ლისთში
# pop() ყოველთვის შლის ბოლო ელემენტს მაგრამ შეგვიძლია მივუთითოთ ინდექსი და წაშლის ელემენტს იმ მითითებულ ინდექსზე



# LEqcia 8 


# ლისტი - შერეულად შენახვა, განსაზღვრული წყობა, შეცვლადი, დუპლიკატები შემიძლია- []
# სეტი - შერეულად შენახვა, არ აქვს განსაზღვრული წყობა, შეცვლადი, დუპლიკატების დამატენა შემიძლია მაგრამ
# მაინც ერთხელ აჩვენს - {} - set()
# დიქტი - {გასაღები:მნიშვნელობა} - გასაღები არის უნიკალური და ველიუ ნებისმიერი შეიძლება იყოს
# გასაღები უნდა იყოს უცვლელი მონაცემთა ტიპი - განსაზღვრული წყობა აქვს  - {}
# tuples - შერეული შენახვა, განსაზღვრული წყობა, შეუცვლელი, დუპლიკატებიც შემიძლია  ()
# lampda არის სწრაფი ფუნქციების გამოძახებისთვის რომელსაც არ სჭირდება ცვლადი სახელი და ასე შემდეგ
#ჰეშირებადი ანუ უცვლელი ელემენტით 



# LEqcia 9 / 10 

#def არის ხელით შექმნილი ფუნქცია სადაც შეგვიზლია გადავცეთ არგუმენტებიბი და გამოძახებაში გადავცეთ პარამეტრები (რეალური მნიშვნელობა)
# პირველი არის გამოცხადება ანუ შექმნა და მერე აუცილებელია ფუნქციის გამოძახება რო იმუშაოს 
# return გვიბრუნებს პასუხს მაგრამ არ ბეჭდავს ინახავს უბრალოდ ფაილში


# *args ვიყენებთ იმ შემთხვევაში როცა არ ვიცით თუ რამდენი პარამეტრი უნდა გადავცეთ
# **kwargs ვიყენებთ იმ შემთხვევაში როცა არ ვიცით თუ რამდენ დიქტს ვიყენებთ
# არსებობს 3 ნაირი არგუმენტის ტიპები: positional (a,b = a b), default როცა შეგიძლია გადააწერო (a, name="ani" = "რამე" "გადააწერს"), keyword(a,b = b a)


# LEQCIA 11  Type Hinting

# lambda ანონიმური ფუნქცია რომელიც გამოიყენება ერთხელ და კვდება
# map(ფუნქცია, კოლექცია) -----> არგუმენტებად გადაეცემა ფუნქცია და ქოლექცია საბოლოო და საწყისი ლისტის მოცულობა ერთია მაგრამ ცვლის თვითონ ფორმატს
# reduce(ფუნქცია, კოლექცია) -----> არგუმენტებად გადაეცემა ფუნქცია და ქოლექცია მთავარი მიზანი გადმოგვცეს საბოლოო მნიშვნელობა
# filter(ფუნქცია, კოლექცია) -----> არგუმენტებად გადაეცემა ფუნქცია და ქოლექცია მაგრამ მაპიდასგან გასხვავებით ეს ფუნქცია ფილტრავს პარამეტრებს და იღებს იმას რაც გვჭირდება
# zip(კოლექცია, კოლექცია) -----> გადაეცემა 2 კოლექცია მთავარი მიზანი დააწყვილოს მაგაში არსებული ელემენტები თუ სადმე ზედმეტია გამოტოვებს მაგას
# LEGB - local, enclose, global თუ გვაქ ერთიდა იგივე დასახელების ცვლადი პროგრამა პირველ რიგში მიაკითხავს ლოკალურად შენახულ ცვლადს მერე შუალედში და საბოოლოდ გლობალურს


# LEQCIA 12  @decorators
# დეკორატორი არის ფუნქცია რომელიც ედება მეორე ფუნქციას და ცვლის მაგის შიგთავს 
# დეკორატორი „ფუთავს“ თქვენს ფუნქციას. ის საშუალებას იძლევა, კოდი შესრულდეს მთავარი ფუნქციის გამოძახებამდე და მის შემდეგ.


# LEQCIA 13  გენერატორები 

# ReGex - regular expressions მაგის საშუალებით შეგვიძლია იუზერს მივუთიტთ რუ რა სიმბოლო ან რიცხვი ან ასო აუცილებლად უნდა იყოს შეყვანილი გამოგვადგება მეილების შექმნაში
# yield - return-თან გასხვავებით შეგვიძლია გამოვიძახოთ რამდენჯერმე 


# LEQCIA 14 ვირტუალური გარემო და მოდულები


# LEQCIA 15 ფაილები 

# open with (location, mode) - უნდა გავცეთ ფაილი ლოკაცია და მოდი რომელიც გვინდა გამოვიყენოთ წაკითხვა ჩაწერა წაკითხვა და ჩაწერა ერთად და ასე შემდეგ
# r = read only, r+ = read and write, w = თუ არსებულ ფაილში რამე არის მთლიანად შლის და წერს მითითებულ ტექსტს თუ ფაილი არ არსებობს შექმნის და შეიყვანს ტექსტს 
# a = არსებულ ტექსტს ამატებს ახალს წაშლის გარეშე
# file.read() - კითხულობს მთლიან ფაილს file.readline() - კითხულობს მარტო ერთ ხაზს და თუ კიდე ჩავწერთ მიყვება ზემოდან ქვემოთ
# file.write - ამატებს ფაილში ტექსტს და მთლიანად შლის ძველს file.seek გადააქვს კურსორს იქ სადაც მიუთითებ


# LEQCIA 16 git, github, OOP 

# klasi aris charcho (shabloni) ris 
# git init აკეთებს ინიციალიზაციას რომ კომანდებუ იმუშაოს კონკრეტულლ ფაილთან